app/controllers/groups_controller.rb

SELECT * FROM `groups`
---
  def index
    @groups = Group.all

INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES('Personal', '2009-09-27 18:21:50', '2009-09-27 18:21:50')
---
  def create
    @group = Group.new(params[:group])
    if @group.save

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
---
  def edit
    @group = Group.find(params[:id])

SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
UPDATE `groups` SET `updated_at` = '2009-09-27 19:05:56', `name` = 'Personal' WHERE `id` = 1
---
  def update
    @group = Group.find(params[:id])
    if @group.update_attributes(params[:group])