app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `avatar_file_name`, `avatar_file_size`, `updated_at`, `group_id`, `avatar_content_type`, `avatar_updated_at`, `email`) VALUES('Bobby Brown', '2009-09-27 18:39:26', 'dont-taunt-octupus.jpg', 100518, '2009-09-27 18:39:26', 1, 'image/jpeg', '2009-09-27 18:39:26', 'bobby@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

SELECT * FROM `users` WHERE (name LIKE '%hank%')
---
  def search
    @users = User.all(:conditions => ["name LIKE ?", "%#{params[:search]}%"])

SELECT * FROM `users` WHERE (`users`.group_id = 1)
UPDATE `users` SET `updated_at` = '2009-09-27 19:34:43', `avatar_file_size` = 21, `avatar_file_name` = 'phpinfo.php', `avatar_updated_at` = '2009-09-27 19:34:43', `avatar_content_type` = 'application/octet-stream' WHERE `id` = 9
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])